# FirstRowNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..FirstRowNumber Property
TableSectionData Class See Also
---
The first row in this section of the table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int FirstRowNumber { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FirstRowNumber As Integer
	Get
```

Visual C++
---
```text
public:
property int FirstRowNumber {
	int get ();
}
```

# Remarks
Some table sections have row 0 as their first row while others start with row 1.
# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace